package by.bogdanova.L19_12_2024;

/*3. Калькулятор остатка
        Напишите программу, которая:

Сохраняет два числа a = 13 и b = 4.
Выводит результат деления a / b (целая часть) и остаток от деления a % b.

Пример вывода:
Целая часть: 3
Остаток: 1*/

public class Homework03 {
    public static void main(String[] args) {
        int a = 13;
        int b = 4;

        System.out.println("Целая часть: " + a/b);
        System.out.println("Остаток: " + a%b);
    }
}
